In [9]:
import pandas as pd

In [10]:
people = {
    "first" : ["Dharani", "Moulali", "Bharath"],
    "last" : ["Kumar", "Naguri", "Koramuntla"],
    "email" : ["gopavaram.dharani@gmail.com", "moulali.naguri@gmail.com", "reddybharath702@gmail.com"]
}

In [11]:
sample_df = pd.DataFrame(people)

In [12]:
sample_df

     first        last                        email
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [13]:
sample_df.columns

Index(['first', 'last', 'email'], dtype='object')

In [24]:
sample_df.columns = ['first_Name', 'last_Name', 'email']  # To rename all the columns in the dataframe

In [25]:
sample_df.columns

Index(['first_Name', 'last_Name', 'email'], dtype='object')

In [26]:
sample_df

  first_Name   last_Name                        email
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [27]:
sample_df.columns = [name.upper() for name in sample_df.columns]  # We can use list comprehension to update all the names

In [29]:
sample_df.columns = sample_df.columns.str.replace('_',' ')

In [32]:
sample_df

  FIRST NAME   LAST NAME                        EMAIL
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [33]:
sample_df.columns = sample_df.columns.str.replace(' ','_')

In [34]:
sample_df

  FIRST_NAME   LAST_NAME                        EMAIL
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [35]:
sample_df.rename(columns={'FIRST_NAME' : 'first', 'LAST_NAME' : 'last'})  # The changes won't get affected in the original dataframe

     first        last                        EMAIL
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [37]:
sample_df

  FIRST_NAME   LAST_NAME                        EMAIL
0    Dharani       Kumar  gopavaram.dharani@gmail.com
1    Moulali      Naguri     moulali.naguri@gmail.com
2    Bharath  Koramuntla    reddybharath702@gmail.com

In [40]:
sample_df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME' : 'last'}, inplace=True)  
# If we use inplace the changes will get affected to the dataframe as well

In [41]:
sample_df

     first        last                        EMAIL
0  Dharani       Kumar  gopavaram.dharani@gmail.com
1  Moulali      Naguri     moulali.naguri@gmail.com
2  Bharath  Koramuntla    reddybharath702@gmail.com

In [43]:
sample_df.iloc[2] = ['Bharath', 'Reddi', 'bharath_koramuntla@gmail.com']  # changing all the values for a particular dataframe

In [44]:
sample_df

     first    last                         EMAIL
0  Dharani   Kumar   gopavaram.dharani@gmail.com
1  Moulali  Naguri      moulali.naguri@gmail.com
2  Bharath   Reddi  bharath_koramuntla@gmail.com